Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: This is an email for reporting non-published potential vulnerabilities. Emails sent to this address are forwarded to the Yocto Project Security Team members.
it_it: Questo indirizzo email è dedicato alla segnalazione di potenziali vulnerabilità non ancora pubblicate. Le email inviate a questo indirizzo vengono inoltrate ai membri di Yocto Project Security Team.

source: This is in contrast to the "GitHub" style workflow where either just a maintainer makes that review, or review is specifically requested from nominated people. We believe there is significant value added to the codebase by this peer review and that moving away from mailing lists would be to the detriment of our code.
it_it: Questo contrasta con il flusso di lavoro in stile "GitHub", dove la revisione viene effettuata solo dal manutentore o richiesta specificamente a persone designate. Crediamo che questo tipo di revisione tra pari apporti un valore significativo al codice sorgente e che abbandonare le mailing list sarebbe dannoso per il nostro codice.

source: This is the top level of the Yocto Project documentation tree. The Yocto Project documentation is always a work in progress, just like the Yocto Project itself. Improvements to the documentation are always welcome; join the :yocto_lists:`docs mailing list </g/docs>` if you want to help out.
it_it: Questo è il livello superiore della struttura della Documentazione di Yocto Project. La documentazione di Yocto Project è in continua evoluzione, proprio come lo Yocto Project stesso. I miglioramenti alla documentazione sono sempre benvenuti; iscriversi alla :yocto_lists:`docs mailing list </g/docs>` per dare una mano.

source: This kind of mechanism is typically used for two reasons:
it_it: Questo tipo di meccanismo viene tipicamente utilizzato per due motivi:

source: This layer contains any recipes, append files, and patches that your project needs.
it_it: Questo layer contiene tutte le ricette, i file di append e le patch necessarie al progetto.

source: This line also runs the ``checksettings`` command, which configures the location of the Toaster :term:`Build Directory`. The Toaster root directory ``TOASTER_DIR`` determines where the Toaster build directory is created on the file system. In the example above, ``TOASTER_DIR`` is set as follows::
it_it: Questa riga esegue anche il comando ``checksettings``, che configura la posizione della :term:`Build Directory` di Toaster. La directory radice di Toaster ``TOASTER_DIR`` determina dove viene creata la directory di build di Toaster sul file system. Nell'esempio precedente, ``TOASTER_DIR`` è impostato come segue::

source: This list requires moderator approval for new topics to be posted, to avoid private security reports to be posted by mistake.
it_it: Questa lista richiede l'approvazione di un moderatore per la pubblicazione di nuovi argomenti, al fine di evitare la pubblicazione accidentale di segnalazioni di sicurezza private.

source: This manual assembles security-related information concerning the whole ecosystem. It includes information on reporting a potential security issue, the operation of the YP Security team and how to contribute in the related code. It is written to be useful for both security researchers and YP developers.
it_it: Questo manuale raccoglie informazioni relative alla sicurezza dell'intero ecosistema. Include informazioni su come segnalare una potenziale vulnerabilità, sul funzionamento del team di sicurezza di YP e su come contribuire al codice correlato. È stato scritto per essere utile sia ai ricercatori di sicurezza che agli sviluppatori YP.

source: This manual does not give you the following:
it_it: Questo manuale non include quanto segue:

source: This manual does not provide the following:
it_it: Questo manuale non fornisce quanto segue:

source: This manual provides the following:
it_it: Questo manuale fornisce quanto segue:

source: This means that shared state will be reused **only if it was signed with the private key corresponding to key identifier**.
it_it: Ciò significa che lo stato condiviso verrà riutilizzato **solo se è stato firmato con la chiave privata corrispondente all'identificatore di chiave**.

source: This mechanism is enabled by default in Poky, and is controlled by three variables:
it_it: Questo meccanismo è abilitato di default in Poky ed è controllato da tre variabili:

source: This naming scheme assumes that :term:`BB_SIGNATURE_HANDLER` is "OEBasicHash", which is almost always the case in current OpenEmbedded.
it_it: Questo schema di denominazione presuppone che :term:`BB_SIGNATURE_HANDLER` è "OEBasicHash", il che è quasi sempre vero nelle versioni attuali di OpenEmbedded.

source: This next list, shows the variables associated with a standard SDK:
it_it: Il seguente elenco mostra le variabili associate a un SDK standard:

source: This optional area contains useful pre-built kernels and user-space filesystem images released with the BSP that are appropriate to the target system. This directory typically contains graphical (e.g. Sato) and minimal live images when the BSP tarball has been created and made available in the :yocto_home:`Yocto Project <>` website. You can use these kernels and images to get a system running and quickly get started on development tasks.
it_it: Questa area opzionale contiene kernel precompilati e immagini del filesystem utente rilasciate con il BSP, adatte al sistema target. Questa directory contiene in genere immagini grafiche (ad esempio Sato) e immagini live minimali, quando il tarball del BSP è stato creato e reso disponibile sul sito web :yocto_home:`Yocto Project <>`. È possibile utilizzare questi kernel e immagini per avviare un sistema e iniziare rapidamente le attività di sviluppo.

source: This optional directory contains miscellaneous recipe files for the BSP. Most notably would be the formfactor files. For example, in the Raspberry Pi BSP, there is the ``formfactor_%.bbappend`` file, which is an append file used to augment the recipe that starts the build. Furthermore, there are machine-specific settings used during the build that are defined by the ``machconfig`` file further down in the directory. Here is the ``machconfig`` file for the Raspberry Pi BSP::
it_it: Questa directory opzionale contiene file di ricette specifici per il BSP. In particolare, si tratta dei file relativi al fattore di forma. Ad esempio, nel BSP per Raspberry Pi, è presente il file ``formfactor_%.bbappend``, un file di append utilizzato per estendere la ricetta che avvia la compilazione. Inoltre, sono presenti impostazioni specifiche della macchina utilizzate durante la compilazione, definite dal file ``machconfig`` più in basso nella directory. Ecco il file ``machconfig`` per il BSP per Raspberry Pi::

source: This optional directory contains recipes for the BSP if it has special requirements for graphics support. All files that are needed for the BSP to support a display are kept here.
it_it: Questa directory opzionale contiene le ricette per il BSP qualora quest'ultimo abbia requisiti specifici per il supporto grafico. Tutti i file necessari al BSP per supportare un display sono conservati qui.

source: This particular append file works for all the machines that are part of the ``meta-yocto-bsp`` layer. The relevant statements are appended with the "beaglebone-yocto" string. The OpenEmbedded build system uses these statements to override similar statements in the kernel recipe:
it_it: Questo particolare file di append funziona per tutte le macchine che fanno parte del layer ``meta-yocto-bsp``. Le istruzioni pertinenti sono aggiunte con la stringa "beaglebone-yocto". Il sistema di build OpenEmbedded utilizza queste istruzioni per sovrascrivere istruzioni simili nella ricetta del kernel:

source: This path can also be an absolute path and be outside of the current working directory:
it_it: Questo path può anche essere un percorso assoluto e trovarsi al di fuori della directory di lavoro corrente:

source: This script sets up the OpenEmbedded build environment. Running this script with the ``source`` command in a shell makes changes to ``PATH`` and sets other core BitBake variables based on the current working directory. You need to run an environment setup script before running BitBake commands. The script uses other scripts within the ``scripts`` directory to do the bulk of the work.
it_it: Questo script configura l'ambiente di build di OpenEmbedded. Eseguendo questo script con il comando ``source`` nella shell, vengono apportate modifiche alla variabile ``PATH`` e vengono impostate altre variabili principali di BitBake in base alla directory di lavoro corrente. È necessario eseguire uno script di configurazione dell'ambiente prima di eseguire i comandi di BitBake. Lo script utilizza altri script presenti nella directory ``scripts`` per svolgere la maggior parte del lavoro.

source: This section briefly introduces BitBake. If you want more information on BitBake, see the :doc:`BitBake User Manual <bitbake:index>`.
it_it: Questa sezione introduce brevemente BitBake. Per ulteriori informazioni su BitBake, consultare il :doc:`Manuale Utente di BitBake <bitbake:index>`.

source: This section defines the default distro value for new projects. By default, it reserves the first Toaster Setting record "1". The following demonstrates how to set the project default value for :term:`DISTRO`:
it_it: Questa sezione definisce il valore di default della distribuzione per i nuovi progetti. Per default, riserva il primo record di Toaster Setting "1". Di seguito viene mostrato come impostare il valore di default del progetto per :term:`DISTRO`:

source: This section describes how to get your build host ready to work with BSP layers. Once you have the host set up, you can create the layer as described in the ":ref:`bsp-manual/bsp:creating a new bsp layer using the \`\`bitbake-layers\`\` script`" section.
it_it: Questa sezione descrive come preparare l'host di build per lavorare con i layer BSP. Una volta configurato l'host, è possibile creare il layer come descritto nella sezione ":ref:`bsp-manual/bsp:creating a new bsp layer using the \`\`bitbake-layers\`\` script`".

source: This section describes requirements and recommendations for a released BSP to be considered compliant with the Yocto Project.
it_it: Questa sezione descrive i requisiti e le raccomandazioni affinché un BSP rilasciato sia considerato conforme a Yocto Project.

source: This section describes the high-level procedure you can follow to create a BSP. Although not required for BSP creation, the ``meta-intel`` repository, which contains many BSPs supported by the Yocto Project, is part of the example.
it_it: Questa sezione descrive la procedura generale per la creazione di un BSP. Sebbene non sia obbligatorio per la creazione di un BSP, il repository ``meta-intel``, che contiene molti BSP supportati da Yocto Project, è parte integrante dell'esempio.

source: This section describes the top-level components of the :term:`Source Directory`.
it_it: Questa sezione descrive i componenti principali della :term:`Source Directory`.

source: This section looks a little closer into the package feeds area used by the build system. Here is a more detailed look at the area:
it_it: Questa sezione esamina più nel dettaglio l'area di feed di pacchetti utilizzata dal sistema di compilazione. Ecco una descrizione più approfondita dell'area:

source: This section only applies if you have set up Toaster for local development, as explained in the ":ref:`toaster-manual/setup-and-use:starting toaster for local development`" section.
it_it: Questa sezione si applica solo se è stato configurato Toaster per lo sviluppo locale, come spiegato nella sezione ":ref:`toaster-manual/setup-and-use:starting toaster for local development`".

source: This section provides an introduction to the choices or development methods you have when setting up your Build Host. Depending on your particular workflow preference and the type of operating system your Build Host runs, you have several choices.
it_it: Questa sezione fornisce un'introduzione alle opzioni o ai metodi di sviluppo disponibili per la configurazione del Build Host. A seconda delle preferenze di flusso di lavoro e del tipo di sistema operativo in esecuzione sul Build Host, sono disponibili diverse opzioni.

source: This section provides brief overviews of the components and tools associated with the Yocto Project.
it_it: Questa sezione fornisce una breve panoramica dei componenti e degli strumenti associati a Yocto Project.

source: This section takes a more detailed look inside the build process used by the :term:`OpenEmbedded Build System`, which is the build system specific to the Yocto Project. At the heart of the build system is BitBake, the task executor.
it_it: Questa sezione analizza in dettaglio il processo di build utilizzato dall':term:`OpenEmbedded Build System`, specifico di Yocto Project. Il cuore del sistema di build è BitBake, l'esecutore delle task.

source: This sets the value of :term:`MACHINE` to ``qemux86-64``.
it_it: Questo imposta il valore di :term:`MACHINE` a ``qemux86-64``.

source: This setting causes the Toaster :term:`Build Directory` to be::
it_it: Questa impostazione determina che la :term:`Build Directory` di Toaster sia::

source: This short document steps you through the process for a typical image build using the Yocto Project. The document also introduces how to configure a build for specific hardware. You will use Yocto Project to build a reference embedded OS called Poky.
it_it: Questo breve documento illustra la procedura per la creazione di un'immagine tipica utilizzando lo Yocto Project. Il documento spiega anche come configurare una build per un hardware specifico. Si userà lo Yocto Project per creare un sistema operativo embedded di riferimento chiamato Poky.

source: This should be the header of patch that fixes :cve_nist:`2015-8370` in GRUB2::
it_it: Questo dovrebbe essere l'header della patch che risolve :cve_nist:`2015-8370` in GRUB2::

source: This started with version 3.1 ("Dunfell"), released in April 2020, which the project initially committed to supporting for two years, but this duration was later extended to four years.
it_it: Questo è iniziato con la versione 3.1 ("Dunfell"), rilasciata nell'aprile 2020, che il progetto inizialmente si era impegnato a supportare per due anni, ma questa durata è stata successivamente estesa a quattro anni.

source: This step in the build process consists of the following tasks:
it_it: Questa fase del processo di build comprende le seguenti attività [task]:

source: This step is optional if you already have a pair of public and private keys.
it_it: Questo passaggio è facoltativo se si dispone già di una coppia di chiavi pubblica e privata.

source: This system is imperfect and changes can sometimes get lost in the flow. Asking about the status of a patch or change is reasonable if the change has been idle for a while with no feedback.
it_it: Questo sistema non è perfetto e a volte le modifiche possono andare perse. È opportuno chiedere informazioni sullo stato di una patch o di una modifica se questa è rimasta inattiva per un po' di tempo senza alcun feedback.

source: This term means "Long Term Support", and in the context of the Yocto Project, it corresponds to selected stable releases for which bug and security fixes are provided for at least four years. See the :ref:`ref-long-term-support-releases` section for details.
it_it: Questo termine ("Long Term Support") significa "Supporto a lungo termine" e, nel contesto di Yocto Project, corrisponde a versioni stabili selezionate per le quali vengono forniti aggiornamenti di bug e sicurezza per almeno quattro anni. Per maggiori dettagli, consultare la sezione :ref:`ref-long-term-support-releases`.

source: This term means *Software Bill of Materials*. When you distribute software, it offers a description of all the components you used, their corresponding licenses, their dependencies, the changes that were applied and the known vulnerabilities that were fixed.
it_it: Questo termine (*Software Bill of Materials*) indica la distinta base del software. Quando si distribuisce un software, la distinta base fornisce una descrizione di tutti i componenti utilizzati, le relative licenze, le dipendenze, le modifiche apportate e le vulnerabilità note corrette.

source: This term means *Software Package Data Exchange*, and is used as an open standard for providing a *Software Bill of Materials* (:term:`SBOM`). This standard is developed through a `Linux Foundation project <https://spdx.dev/>`__ and is used by the OpenEmbedded Build System to provide an :term:`SBOM` associated to each software image.
it_it: Questo termine sta per *Software Package Data Exchange* e viene utilizzato come standard aperto per fornire una *Software Bill of Materials* (:term:`SBOM`) [distinta base software]. Questo standard è sviluppato nell'ambito del `progetto Linux Foundation <https://spdx.dev/>`__ e viene utilizzato dal sistema di build OpenEmbedded per fornire una :term:`SBOM` associata a ciascuna immagine software.

source: This term refers to the area used by the OpenEmbedded build system for builds. The area is created when you ``source`` the setup environment script that is found in the Source Directory (i.e. :ref:`structure-core-script`, or ``init-build-env`` when using :doc:`bitbake-setup <bitbake:bitbake-user-manual/bitbake-user-manual-environment-setup>`). The :term:`TOPDIR` variable points to the :term:`Build Directory`.
it_it: Questo termine si riferisce all'area utilizzata dal sistema di compilazione OpenEmbedded per le build. L'area viene creata quando si esegue ``source`` lo script di configurazione dell'ambiente che si trova nella directory dei sorgenti (ad esempio, :ref:`structure-core-script` o ``init-build-env`` quando si utilizza :doc:`bitbake-setup <bitbake:bitbake-user-manual/bitbake-user-manual-environment-setup>`). La variabile :term:`TOPDIR` punta alla :term:`Build Directory`.

source: This term refers to the directory structure created as a result of setting up your environment to build images with the Yocto Project, which can be done in two ways:
it_it: Questo termine [Directory Sorgente] si riferisce alla struttura di directory creata a seguito della configurazione dell'ambiente per la creazione di immagini con Yocto Project, operazione che può essere eseguita in due modi:

source: This tool is a "native" tool (i.e. it is designed to run on the build host).
it_it: Questo strumento è "nativo" (ovvero, è progettato per essere eseguito sull'host di compilazione).

source: This way, site-specific settings can be shared for multiple build configurations.
it_it: In questo modo, le impostazioni specifiche del sito possono essere condivise tra diverse configurazioni di build.

source: This will be our example configuration in the following sections.
it_it: Questa sarà la configurazione di esempio nelle sezioni seguenti.

source: This will enable the :ref:`ref-classes-sbom-cve-check` class and set the recommended settings to use it.
it_it: Questo abiliterà la classe :ref:`ref-classes-sbom-cve-check` e imporrà le impostazioni consigliate per il suo utilizzo.

source: This will open a text editor to fill in the description for your changes. This description can be updated when necessary and will be used by Git to create the cover letter together with the patches.
it_it: Questo aprirà un editor di testo in cui si potrà inserire la descrizione delle modifiche. Questa descrizione può essere aggiornata quando necessario e verrà utilizzata da Git per creare la lettera di presentazione insieme alle patch.

source: Those are many steps and details, but fortunately Yocto includes a script called ``crosstap`` that will take care of those details, allowing you to just execute a SystemTap script on the remote target, with arguments if necessary.
it_it: Ci sono molti passaggi e dettagli da considerare, ma fortunatamente Yocto include uno script chiamato ``crosstap`` che si occupa di questi dettagli, permettendoti di eseguire uno script SystemTap sul sistema remoto, con argomenti se necessario.

source: Those maintainers are active and responsive.
it_it: Tali manutentori sono attivi e "responsive" [reattivi].

source: Thousands of developers worldwide have discovered that Yocto Project provides advantages in both systems and applications development, archival and management benefits, and customizations used for speed, footprint, and memory utilization. The project is a standard when it comes to delivering embedded software stacks. The project allows software customizations and build interchange for multiple hardware platforms as well as software stacks that can be maintained and scaled.
it_it: Migliaia di sviluppatori in tutto il mondo hanno scoperto che Yocto Project offre vantaggi sia nello sviluppo di sistemi che di applicazioni, sia in termini di archiviazione e gestione, sia per quanto riguarda le personalizzazioni in termini di velocità, ingombro e utilizzo della memoria. Il progetto è uno standard per la fornitura di stack software embedded. Il progetto consente la personalizzazione del software e lo scambio di build per diverse piattaforme hardware, nonché stack software che possono essere mantenuti e scalati.

source: Throughout this section, many variables and their meanings are introduced. If, in the context of a :term:`Build Directory`, you want to examine the value of any of these variables, you can use the ``bitbake-getvar`` command, explained in the ":ref:`dev-manual/debugging:viewing variable values`" section.
it_it: In questa sezione vengono introdotte numerose variabili e i relativi significati. Se, nel contesto di una directory di compilazione (:term:`Build Directory`), si desidera esaminare il valore di una di queste variabili, è possibile utilizzare il comando ``bitbake-getvar``, descritto nella sezione ":ref:`dev-manual/debugging:viewing variable values`".

source: Thus far, this section has limited discussion to the direct inputs into a task. Information based on direct inputs is referred to as the "basehash" in the code. However, the question of a task's indirect inputs still exits --- items already built and present in the :term:`Build Directory`. The checksum (or signature) for a particular task needs to add the hashes of all the tasks on which the particular task depends. Choosing which dependencies to add is a policy decision. However, the effect is to generate a checksum that combines the basehash and the hashes of the task's dependencies.
it_it: Finora, questa sezione si è limitata a discutere gli input diretti di un task. Le informazioni basate sugli input diretti vengono definite "basehash" nel codice. Tuttavia, rimane aperta la questione degli input indiretti di un task, ovvero gli elementi già compilati e presenti nella :term:`Build Directory`. Il checksum (o firma) di un particolare task deve sommare gli hash di tutti i task da cui dipende. La scelta delle dipendenze da aggiungere è una decisione di policy. L'effetto, tuttavia, è quello di generare un checksum che combina il basehash e gli hash delle dipendenze del task.

source: Tips and Guidelines for Writing Recipes
it_it: Suggerimenti e Linee Guida per la Scrittura di Ricette

source: To access the Django administration interface, you must create a superuser by following these steps:
it_it: Per accedere all'interfaccia di amministrazione di Django, si deve creare un superutente seguendo questi passaggi:

source: To access the Toaster web interface, open your favorite browser and enter the following::
it_it: Per accedere all'interfaccia web di Toaster, aprire il browser di default e inserire quanto segue:
